# Банкомат
# Напишите код банкомата, который принимает цифру, выдает
# деньги с номиналом 5000, 2000, 1000, 500, 200, 100, 50, 20, 10, 5, 3, 1.
y = int(input('Введите сумму которую хотите снять-'))
def bankomat():
	return y
print('выдача денег: ',bankomat())
