#1
#text='Google создаст специальную команду для поиска багов в особо важных приложениях.'
#print(len( text.split(' ')))
#2
#text="У вас есть строка 'Запуск Ethereum 2.0 состоится 1 декабря. На депозитный контракт внесено более 524 288 ETH'"
#a = text.split(' ')
#print(a)
#3
#text="хакеры слили в сеть данные пакистанской энергетической компании k-Electric"
#print(text.upper())
#4
#text=input('Введите текст: ')
#x='GitHub'
#print(text.replace(x,text))
#5
#text='Ботнет IPStorm , в который ранее входили лишь Windows-машины, увеличился до 13 500 зараженных систем'
#print(text.replace("е" ," 3"))

rabota="Разработчик на основе Java,Python,C++,C#"
strana="Германия,США,"
zp="от 5 тыс $"
print("Желаемая работа-"+rabota, '\n',"Страна-"+strana,'\n',"Желаемая зарплата-"+zp,'\n' )
